$Form1 = GUICreate(" 一键恢复", 400, 100) ;au3窗体及大小
$txt ="本系统由年老痴呆封装"&@LF& _
"安徽新诚服装有限公司所有"&@LF&@LF& _
"本系统属个人与个人之间交流使用，请勿传播。"&@LF& _
"供学习和研究软件内含的设计思想和原理。"&@LF& _
"----------------------------------------"&@LF& _
"&@LF _使用本作品时，如果遇到不能解决的问题，"&@LF& _
"请与年老痴呆联系，QQ：1065960210."&@LF& _
"本人会尽自己的能力给予帮助。"&@LF& _
"----------------------------"&@LF&@LF& _
"S&R&S9.7程序：死性不改"&@LF& _
"Dllcache工具：陈辉"&@LF& _
"        封装：年老痴呆"&@LF& _
"---------------------------"&@LF&@LF& _
"2010年02月3日"
GUICtrlCreateLabel($txt,0,0,400,202)

GUISetState()

$y=0
While GUIGetMsg()+3
        $y-=2
        GUICtrlSetPos(-1,0,$y)
        sleep(200)
        If $y=-202 Then $y=102
WEnd